#数据宽度显示问题
#定义浮点数变量f1，f2，f3
f1,f2,f3=3.14,1234.5678,93485.4564
print(f"f1={f1:10.2f}")
print(f"f2={f2:10.2f}")
print(f"f2={f3:10.2f}")
print(f"f2={f3:4.2f}")
#格式:{变量:宽度.精度f}

str1="杜甫"
print(f"{str1:10}")
#在指定数据宽度的情况下,只要格式符起作用,那么,数值居右对,字符串居左对齐


#长浮点数的解读问题
f4=218317231.239842894
print(f"{f4:20.2}")#无 f 时，以科学计数法方式显示
print(f"{f4:20.2f}")
#编写顺序{变量名称:宽度 千分位符 逗号 精度f}

#指定数据的对齐方式
print(f"{f4:-<20,.2f}")  #左对齐
print(f"{f4:-^20,.2f}")  #居中对齐
print(f"{f4:->20,.2f}")  #右对齐
#编写顺序 f{变量名称：填充符 对齐方式 宽度 千分位符 逗号 精度f}

num1=340
str_num1=f"E{num1:0>8}"
#格式符,在赋值的时候,会先进行展开计算,然后将计算结果赋值给变量
print(str_num1)