#序列加法 就是两个序列的拼接
l1=[1,2,3,4]
l2=[4,5,6,7]
l3=l1+l2#将两个序列元素合并到一起 构成新的序列
print(l3)

str1="abcdef"
str2="12345"
str3=str1+str2#字符串序列加法
print(str3)

#元组序列的加法
t1=(1,2,3,4,5)
t2=(5,6,7,8,9)
t3=t1+t2
print(t3)

#序列的混合拼接---不同类型的序列间的加法计算
s1=[1,2,3,4,5]
s2=(5,6,7,8,9)
s3="abcdef"
# s4=s1+s2#不同类型的序列不可以直接进行加法计算
# print(s4)

# seq=[1,2,3,4,5]
# #序列类型之间的转换
# list(seq) #可以将任意类型的序列转换成列表
# print(tuple(seq))#可以将任意类型的序列转换成元组
# str(seq)#可以将任意类型的序列转换成字符串

s5=s1+list(s2)+list(s3)
print(s5)

s6=s2+tuple(s1)+tuple(s3)
print(s6)